# 变量 在程序运行过程中，其值可以修改的量
# 常量 。。。。。。。。。值不能发生变化的量
# a = 5
# b = 8
# a = 0
# c = a + b
# print(c)

# 变量定义的形式,单个变量
a = 3

# 定义多个变量,具有相同的初值
# 书写风格，等号两边留空格，逗号后面留空格
a = b = 2
# print('a = ', a, ',b = ',b)

# 在Python中不允许这样定义变量
# a = 3, b = 2

#3 元组赋值
# a,b,c = 2,3,10
# print(a,b,c)

# 变量命名的规则
# 变量名由数字、字母、下划线组成，不能以数字开头
__a = 1
a_1 = 2
# 1a = 2 以数字开头错误
__ = 2
# a&2 = 9 包含了非数字、字母、下划线的成分
# 2.不能是系统保留字
# 查看系统保留字
# import keyword
# print(keyword.kwlist)

# 3.变量名区分大小写
a = 2
# print(A)   a和A是不同的变量

# 变量命名的风格
# 变量命名一般遵循小驼峰规则：myName
# 也可以使用下划线分割：my_name_book
# 命名的时候见名知意









